In [2]:
import mysql.connector
import json
import pandas as pd
import sqlalchemy

In [3]:
mydb=mysql.connector.connect(
    host='localhost',
    user='root',
    password='rahshiri'
)
mycursor=mydb.cursor()
mycursor.execute('create database if not exists imdb')

In [4]:

data = json.load(open('imdb-scraped.json'))

In [5]:
df=pd.DataFrame(data)

In [6]:


df.head(3)

,Movie_id,Title,Year,Parental_Guide,Runtime,Genre,Director,Writer,Star,Gross_US_Canada
0,0111161,The Shawshank Redemption,1994,R,2h 22m,[Drama],"[[0001104, Frank Darabont]]","[[0000175, Stephen King], [0001104, Frank Dara...","[[0000209, Tim Robbins], [0000151, Morgan Free...","$28,767,189"
1,0068646,The Godfather,1972,R,2h 55m,"[Crime, Drama]","[[0000338, Francis Ford Coppola]]","[[0701374, Mario Puzo], [0000338, Francis Ford...","[[0000008, Marlon Brando], [0000199, Al Pacino...","$136,381,073"
2,0468569,The Dark Knight,2008,PG-13,2h 32m,"[Action, Crime, Drama]","[[0634240, Christopher Nolan]]","[[0634300, Jonathan Nolan], [0634240, Christop...","[[0000288, Christian Bale], [0005132, Heath Le...","$534,987,076"

In [7]:
df_cast1=pd.concat([df['Movie_id'],df['Star']],axis=1)
def func(input):
    return input[0]
df_cast2=df_cast1.explode('Star')
df_cast2['Star']=df_cast2['Star'].apply(func)
df_cast=df_cast2.reset_index(drop=True)
df_cast=df_cast.rename(columns={'Star':'Person_id'})
df_cast

    Movie_id Person_id
0    0111161   0000209
1    0111161   0000151
2    0111161   0348409
3    0068646   0000008
4    0068646   0000199
..       ...       ...
745  4430212   1328152
746  4430212   0007102
747  0103639   0918334
748  0103639   0000245
749  0103639   0488306

[750 rows x 2 columns]

In [8]:
df_Director1=pd.concat([df['Movie_id'],df['Director']],axis=1)
df_crew2=df_Director1.explode('Director')
df_crew2['role']='director'
df_crew2=df_crew2.rename(columns={'Director':'Person_id'})
df_Writer1=pd.concat([df['Movie_id'],df['Writer']],axis=1)
df_crew1=df_Writer1.explode('Writer')
df_crew1['role']='writer'
df_crew1=df_crew1.rename(columns={'Writer':'Person_id'})
df_crew=pd.concat([df_crew1,df_crew2],axis=0)
def func(input):
    return input[0]
df_crew['Person_id']=df_crew['Person_id'].apply(func)
df_crew=df_crew.reset_index(drop=True)
df_crew

    Movie_id Person_id      role
0    0111161   0000175    writer
1    0111161   0001104    writer
2    0068646   0701374    writer
3    0068646   0000338    writer
4    0468569   0634300    writer
..       ...       ...       ...
834  0025316   0001008  director
835  0053198   0000076  director
836  4430212   1723225  director
837  0103639   0166256  director
838  0103639   0615780  director

[839 rows x 3 columns]

In [9]:
df_dir=df['Director'].explode().to_list()
df_directors=pd.DataFrame(df_dir)
df_writ=df['Writer'].explode().to_list()
df_writers=pd.DataFrame(df_writ)
df_star=df['Star'].explode().to_list()
df_stars=pd.DataFrame(df_star)
df_person1=pd.concat([df_directors,df_stars,df_writers],axis=0)
df_person1=df_person1.rename(columns={0:'id',1:'Name'})
df_person=df_person1.drop_duplicates().reset_index(drop=True)
df_person

           id                  Name
0     0001104        Frank Darabont
1     0000338  Francis Ford Coppola
2     0634240     Christopher Nolan
3     0001486          Sidney Lumet
4     0000229      Steven Spielberg
...       ...                   ...
1078  0728307         Robert Riskin
1079  0011343  Samuel Hopkins Adams
1080  0610115         Marcel Moussy
1081  2572228         Jeethu Joseph
1082  3179723       Upendra Sidhaye

[1083 rows x 2 columns]

In [10]:
def func1(input):
       if ('h' in input) & ('m' in input):
          return int(input.split('h')[0])*60+int(input.split('h')[1].split('m')[0])
       if ('h' in input) & ('m' not in input):
          return int(input.split('h')[0])*60
       if ('h' not in input) & ('m' in input):
          return int(input.split('m')[0])
df['Runtime']=df['Runtime'].apply(func1)

In [11]:
df['Year']=df['Year'].astype(int)

In [12]:
def func2(input):
    if input !=None:
        return int(input.replace(',','').split('$')[1])
df['Gross_US_Canada']=df['Gross_US_Canada'].apply(func2)

In [13]:
df.loc[(df['Parental_Guide'] == 'Not Rated'), 'Parental_Guide'] = 'Unrated'
df['Parental_Guide']=df['Parental_Guide'].fillna('Unrated')

In [14]:
df_movie=df[['Movie_id','Title','Year','Runtime','Parental_Guide','Gross_US_Canada']]
df_movie

,Movie_id,Title,Year,Runtime,Parental_Guide,Gross_US_Canada
0,0111161,The Shawshank Redemption,1994,142,R,28767189.0
1,0068646,The Godfather,1972,175,R,136381073.0
2,0468569,The Dark Knight,2008,152,PG-13,534987076.0
3,0071562,The Godfather Part II,1974,202,R,47834595.0
4,0050083,12 Angry Men,1957,96,Approved,NaN
...,...,...,...,...,...,...
245,1454029,The Help,2011,146,PG-13,169708112.0
246,0025316,It Happened One Night,1934,105,Passed,NaN
247,0053198,The 400 Blows,1959,99,Unrated,509.0
248,4430212,Drishyam,2015,163,Unrated,NaN
249,0103639,Aladdin,1992,90,G,217350219.0

In [15]:
df_genre=df[['Movie_id','Genre']].explode('Genre').reset_index(drop=True)
df_genre

    Movie_id      Genre
0    0111161      Drama
1    0068646      Crime
2    0068646      Drama
3    0468569     Action
4    0468569      Crime
..       ...        ...
630  4430212      Drama
631  4430212    Mystery
632  0103639  Animation
633  0103639  Adventure
634  0103639     Comedy

[635 rows x 2 columns]

In [31]:
df_cast.to_csv('cast.csv')
df_crew.to_csv('crew.csv')
df_movie.to_csv('movie.csv')
df_person.to_csv('person.csv')
df_genre.to_csv('genre.csv')

In [16]:
from sqlalchemy import create_engine
from sqlalchemy import text
engine = create_engine('mysql+mysqlconnector://root:rahshiri@localhost/imdb', echo=True)
with engine.connect() as conn:
    conn.execute(text("""create table if not exists movie (Movie_id varchar(8) primary key,
                                              Title varchar(128),
                                              Year int,
                                              Runtime int,
                                              Parental_Guide varchar(8),
                                              Gross_US_Canada int ) """))
    conn.execute(
         text("""insert into movie (Movie_id,Title,Year,Runtime,Parental_Guide,Gross_US_Canada) 
                 values (:Movie_id,:Title,:Year,:Runtime,:Parental_Guide,:Gross_US_Canada)"""),
       df_movie.to_dict('records')
    )
    conn.commit()

2024-02-04 00:28:38,415 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2024-02-04 00:28:38,420 INFO sqlalchemy.engine.Engine [raw sql] {}

2024-02-04 00:28:38,503 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2024-02-04 00:28:38,512 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:28:38,526 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2024-02-04 00:28:38,528 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:28:38,539 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-02-04 00:28:38,540 INFO sqlalchemy.engine.Engine create table if not exists movie (Movie_id varchar(8) primary key,
                                              Title varchar(128),
                                              Year int,
                                              Runtime int,
                                              Parental_Guide varchar(8),
                                              Gross_US_Canada int )
2024-02-04 00:28:38,542 INFO sqlalchemy.engine.Engine [generated in 0.00461s] {}
2024-02-04 00:28:38,574 INFO sqlalchemy.engine.Engine insert into movie (Movie_id,Title,Year,Runtime,Parental_Guide,Gross_US_Canada)
                 values (%(Movie_id)s,%(Title)s,%(Year)s,%(Runtime)s,%(Parental_Guide)s,%(Gross_US_Canada)s)
2024-02-04 00:28:38,581 INFO sqlalchemy.engine.Engine [generated in 0.01819s] [{'Movie_id': '0111161', 'Title': 'The Shawshank Redemption', 'Year': 1994, 'Runtime': 142, 'Parental_Guide': 'R', 'Gross_US_Canada': 28767189.0}, {'Movie_id': '0068646', 'Title': 'The Godfather', 'Year': 1972, 'Runtime': 175, 'Parental_Guide': 'R', 'Gross_US_Canada': 136381073.0}, {'Movie_id': '0468569', 'Title': 'The Dark Knight', 'Year': 2008, 'Runtime': 152, 'Parental_Guide': 'PG-13', 'Gross_US_Canada': 534987076.0}, {'Movie_id': '0071562', 'Title': 'The Godfather Part II', 'Year': 1974, 'Runtime': 202, 'Parental_Guide': 'R', 'Gross_US_Canada': 47834595.0}, {'Movie_id': '0050083', 'Title': '12 Angry Men', 'Year': 1957, 'Runtime': 96, 'Parental_Guide': 'Approved', 'Gross_US_Canada': nan}, {'Movie_id': '0108052', 'Title': "Schindler's List", 'Year': 1993, 'Runtime': 195, 'Parental_Guide': 'R', 'Gross_US_Canada': 96898818.0}, {'Movie_id': '0167260', 'Title': 'The Lord of the Rings: The Return of the King', 'Year': 2003, 'Runtime': 201, 'Parental_Guide': 'PG-13', 'Gross_US_Canada': 379427292.0}, {'Movie_id': '0110912', 'Title': 'Pulp Fiction', 'Year': 1994, 'Runtime': 154, 'Parental_Guide': 'R', 'Gross_US_Canada': 107928762.0}  ... displaying 10 of 250 total bound parameter sets ...  {'Movie_id': '4430212', 'Title': 'Drishyam', 'Year': 2015, 'Runtime': 163, 'Parental_Guide': 'Unrated', 'Gross_US_Canada': nan}, {'Movie_id': '0103639', 'Title': 'Aladdin', 'Year': 1992, 'Runtime': 90, 'Parental_Guide': 'G', 'Gross_US_Canada': 217350219.0}]
2024-02-04 00:28:38,615 INFO sqlalchemy.engine.Engine COMMIT

In [20]:
from sqlalchemy import create_engine
from sqlalchemy import text
engine = create_engine('mysql+mysqlconnector://root:rahshiri@localhost/imdb', echo=True)

with engine.connect() as conn:
    conn.execute(text("""create table if not exists  person (id varchar(8) primary key,
                                              Name varchar(32) ) """))
    conn.execute(
         text("""insert into person (id,Name) 
                 values (:id,:Name)"""),
       df_person.to_dict('records')
    )
    conn.commit()

2024-02-04 00:29:41,684 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2024-02-04 00:29:41,688 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:41,695 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2024-02-04 00:29:41,698 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:41,722 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2024-02-04 00:29:41,724 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:41,732 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-02-04 00:29:41,733 INFO sqlalchemy.engine.Engine create table if not exists  person (id varchar(8) primary key,
                                              Name varchar(32) )
2024-02-04 00:29:41,737 INFO sqlalchemy.engine.Engine [generated in 0.00584s] {}
2024-02-04 00:29:41,780 INFO sqlalchemy.engine.Engine insert into person (id,Name)
                 values (%(id)s,%(Name)s)
2024-02-04 00:29:41,781 INFO sqlalchemy.engine.Engine [generated in 0.01224s] [{'id': '0001104', 'Name': 'Frank Darabont'}, {'id': '0000338', 'Name': 'Francis Ford Coppola'}, {'id': '0634240', 'Name': 'Christopher Nolan'}, {'id': '0001486', 'Name': 'Sidney Lumet'}, {'id': '0000229', 'Name': 'Steven Spielberg'}, {'id': '0001392', 'Name': 'Peter Jackson'}, {'id': '0000233', 'Name': 'Quentin Tarantino'}, {'id': '0001466', 'Name': 'Sergio Leone'}  ... displaying 10 of 1083 total bound parameter sets ...  {'id': '2572228', 'Name': 'Jeethu Joseph'}, {'id': '3179723', 'Name': 'Upendra Sidhaye'}]
2024-02-04 00:29:41,839 INFO sqlalchemy.engine.Engine COMMIT

In [21]:
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:rahshiri@localhost/imdb', echo=True)
from sqlalchemy import text
with engine.connect() as conn:
    conn.execute(text("""create table if not exists cast ( id int auto_increment Primary Key,
                                              Movie_id varchar(8),
                                              Person_id varchar(8), 
                                              Foreign key (Movie_id) References movie(Movie_id),         
                                              Foreign key (Person_id) References person(id) ) """))
    conn.execute(
         text("""insert into cast (Movie_id,Person_id) 
                 values (:Movie_id,:Person_id)"""),
       df_cast.to_dict('records')
    )
    conn.commit()

2024-02-04 00:29:44,058 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2024-02-04 00:29:44,059 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:44,066 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2024-02-04 00:29:44,068 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:44,081 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2024-02-04 00:29:44,082 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:44,104 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-02-04 00:29:44,107 INFO sqlalchemy.engine.Engine create table if not exists cast ( id int auto_increment Primary Key,
                                              Movie_id varchar(8),
                                              Person_id varchar(8),
                                              Foreign key (Movie_id) References movie(Movie_id),
                                              Foreign key (Person_id) References person(id) )
2024-02-04 00:29:44,109 INFO sqlalchemy.engine.Engine [generated in 0.00763s] {}
2024-02-04 00:29:44,314 INFO sqlalchemy.engine.Engine insert into cast (Movie_id,Person_id)
                 values (%(Movie_id)s,%(Person_id)s)
2024-02-04 00:29:44,316 INFO sqlalchemy.engine.Engine [generated in 0.00598s] [{'Movie_id': '0111161', 'Person_id': '0000209'}, {'Movie_id': '0111161', 'Person_id': '0000151'}, {'Movie_id': '0111161', 'Person_id': '0348409'}, {'Movie_id': '0068646', 'Person_id': '0000008'}, {'Movie_id': '0068646', 'Person_id': '0000199'}, {'Movie_id': '0068646', 'Person_id': '0001001'}, {'Movie_id': '0468569', 'Person_id': '0000288'}, {'Movie_id': '0468569', 'Person_id': '0005132'}  ... displaying 10 of 750 total bound parameter sets ...  {'Movie_id': '0103639', 'Person_id': '0000245'}, {'Movie_id': '0103639', 'Person_id': '0488306'}]
2024-02-04 00:29:44,378 INFO sqlalchemy.engine.Engine COMMIT

In [22]:
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:rahshiri@localhost/imdb', echo=True)
from sqlalchemy import text
with engine.connect() as conn:
    conn.execute(text("""create table if not exists crew ( id int auto_increment Primary Key,
                                              Movie_id varchar(8),
                                              Person_id varchar(8),
                                              role varchar(8), 
                                              Foreign key (Movie_id) References movie(Movie_id),         
                                              Foreign key (Person_id) References person(id)  ) """))
    conn.execute(
         text("""insert into crew (Movie_id,Person_id,role) 
                 values (:Movie_id,:Person_id,:role)"""),
       df_crew.to_dict('records')
    )
    conn.commit()

2024-02-04 00:29:49,756 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2024-02-04 00:29:49,759 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:49,764 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2024-02-04 00:29:49,764 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:49,777 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2024-02-04 00:29:49,778 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:29:49,782 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-02-04 00:29:49,783 INFO sqlalchemy.engine.Engine create table if not exists crew ( id int auto_increment Primary Key,
                                              Movie_id varchar(8),
                                              Person_id varchar(8),
                                              role varchar(8),
                                              Foreign key (Movie_id) References movie(Movie_id),
                                              Foreign key (Person_id) References person(id)  )
2024-02-04 00:29:49,787 INFO sqlalchemy.engine.Engine [generated in 0.00565s] {}
2024-02-04 00:29:49,850 INFO sqlalchemy.engine.Engine insert into crew (Movie_id,Person_id,role)
                 values (%(Movie_id)s,%(Person_id)s,%(role)s)
2024-02-04 00:29:49,851 INFO sqlalchemy.engine.Engine [generated in 0.00697s] [{'Movie_id': '0111161', 'Person_id': '0000175', 'role': 'writer'}, {'Movie_id': '0111161', 'Person_id': '0001104', 'role': 'writer'}, {'Movie_id': '0068646', 'Person_id': '0701374', 'role': 'writer'}, {'Movie_id': '0068646', 'Person_id': '0000338', 'role': 'writer'}, {'Movie_id': '0468569', 'Person_id': '0634300', 'role': 'writer'}, {'Movie_id': '0468569', 'Person_id': '0634240', 'role': 'writer'}, {'Movie_id': '0468569', 'Person_id': '0275286', 'role': 'writer'}, {'Movie_id': '0071562', 'Person_id': '0000338', 'role': 'writer'}  ... displaying 10 of 839 total bound parameter sets ...  {'Movie_id': '0103639', 'Person_id': '0166256', 'role': 'director'}, {'Movie_id': '0103639', 'Person_id': '0615780', 'role': 'director'}]
2024-02-04 00:29:49,926 INFO sqlalchemy.engine.Engine COMMIT

In [18]:
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:rahshiri@localhost/imdb', echo=True)
from sqlalchemy import text
with engine.connect() as conn:
    conn.execute(text("""create table if not exists genre_movie ( id int auto_increment Primary Key,
                                              Movie_id varchar(8),
                                              Genre varchar(16),
                                              Foreign key (Movie_id) References movie(Movie_id) ) """))
    conn.execute(
         text("""insert into genre_movie (Movie_id,Genre) 
                 values (:Movie_id,:Genre)"""),
       df_genre.to_dict('records')
    )
    conn.commit()

2024-02-04 00:28:52,087 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2024-02-04 00:28:52,088 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:28:52,096 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2024-02-04 00:28:52,099 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-02-04 00:28:52,106 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2024-02-04 00:28:52,107 INFO sqlalchemy.engine.Engine [raw sql] {}

2024-02-04 00:28:52,115 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-02-04 00:28:52,119 INFO sqlalchemy.engine.Engine create table if not exists genre_movie ( id int auto_increment Primary Key,
                                              Movie_id varchar(8),
                                              Genre varchar(16),
                                              Foreign key (Movie_id) References movie(Movie_id) )
2024-02-04 00:28:52,123 INFO sqlalchemy.engine.Engine [generated in 0.01082s] {}
2024-02-04 00:28:52,202 INFO sqlalchemy.engine.Engine insert into genre_movie (Movie_id,Genre)
                 values (%(Movie_id)s,%(Genre)s)
2024-02-04 00:28:52,204 INFO sqlalchemy.engine.Engine [generated in 0.00987s] [{'Movie_id': '0111161', 'Genre': 'Drama'}, {'Movie_id': '0068646', 'Genre': 'Crime'}, {'Movie_id': '0068646', 'Genre': 'Drama'}, {'Movie_id': '0468569', 'Genre': 'Action'}, {'Movie_id': '0468569', 'Genre': 'Crime'}, {'Movie_id': '0468569', 'Genre': 'Drama'}, {'Movie_id': '0071562', 'Genre': 'Crime'}, {'Movie_id': '0071562', 'Genre': 'Drama'}  ... displaying 10 of 635 total bound parameter sets ...  {'Movie_id': '0103639', 'Genre': 'Adventure'}, {'Movie_id': '0103639', 'Genre': 'Comedy'}]
2024-02-04 00:28:52,280 INFO sqlalchemy.engine.Engine COMMIT